test_results/ab_c10_n100_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      10
Time taken for tests:   1.329 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      36200 bytes
HTML transferred:       21600 bytes
Requests per second:    75.23 [#/sec] (mean)
Time per request:       132.934 [ms] (mean)
Time per request:       13.293 [ms] (mean, across all concurrent requests)
Transfer rate:          26.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.1      0       6
Processing:    18  126  31.8    129     206
Waiting:        8  115  30.5    115     198
Total:         18  127  31.1    130     207

Percentage of the requests served within a certain time (ms)
  50%    130
  66%    139
  75%    148
  80%    152
  90%    162
  95%    172
  98%    179
  99%    207
 100%    207 (longest request)