test_results/ab_c1_n10000_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      1
Time taken for tests:   121.331 seconds
Complete requests:      10000
Failed requests:        3689
   (Connect: 0, Receive: 0, Length: 3689, Exceptions: 0)
Total transferred:      3615849 bytes
HTML transferred:       2155849 bytes
Requests per second:    82.42 [#/sec] (mean)
Time per request:       12.133 [ms] (mean)
Time per request:       12.133 [ms] (mean, across all concurrent requests)
Transfer rate:          29.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:     9   11   1.9     11      63
Waiting:        7    9   1.7      9      61
Total:          9   12   2.0     11      64

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     13
  80%     13
  90%     14
  95%     15
  98%     17
  99%     18
 100%     64 (longest request)