test_results/ab_c1_n10000_run4.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        215 bytes

Concurrency Level:      1
Time taken for tests:   120.611 seconds
Complete requests:      10000
Failed requests:        6015
   (Connect: 0, Receive: 0, Length: 6015, Exceptions: 0)
Total transferred:      3616015 bytes
HTML transferred:       2156015 bytes
Requests per second:    82.91 [#/sec] (mean)
Time per request:       12.061 [ms] (mean)
Time per request:       12.061 [ms] (mean, across all concurrent requests)
Transfer rate:          29.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     9   11   2.0     11      63
Waiting:        7    9   1.7      9      61
Total:          9   12   2.0     11      64

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     12
  80%     13
  90%     14
  95%     15
  98%     17
  99%     19
 100%     64 (longest request)