test_results/ab_c1_n1000_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      1
Time taken for tests:   12.011 seconds
Complete requests:      1000
Failed requests:        470
   (Connect: 0, Receive: 0, Length: 470, Exceptions: 0)
Total transferred:      361530 bytes
HTML transferred:       215530 bytes
Requests per second:    83.25 [#/sec] (mean)
Time per request:       12.011 [ms] (mean)
Time per request:       12.011 [ms] (mean, across all concurrent requests)
Transfer rate:          29.39 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:     9   11   1.6     11      21
Waiting:        7    9   1.4      9      20
Total:         10   12   1.6     11      22

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     13
  80%     13
  90%     14
  95%     15
  98%     16
  99%     17
 100%     22 (longest request)